Project/Toir/src/DataProcessors/торо_ПолучениеИВозвратМатериалов/торо_ПолучениеИВозвратМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_ПолучениеИВозвратМатериалов</name>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОстатокВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийИзлишекДефицит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланируемыйИзлишекДефицит</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ремонты</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ПланГрафикРемонта</types>
        <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РемонтВыполняется</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьДокументыЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВЗаказеЕстьВсеПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТребуемоеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>ДокументЗаказа</name>
      <type>
        <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказанноеКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Project/Toir/src/Documents/торо_ПланГрафикРемонта/торо_ПланГрафикРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ПланГрафикРемонта</name>
  <basedOn>Document.торо_ПланГрафикРемонта</basedOn>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>AccumulationRegister.торо_ВремяПростояОборудования</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>AccumulationRegister.торо_ОстановленноеОборудование</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеРемонтныеРаботы</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладВнутреннихЗаказов</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ПланГрафикРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияВладелец</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеВладелец</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбъектыРемонта</name>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ЦепочкиРемонта</types>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЦепочка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Перенесенный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/DataProcessors/торо_ПолучениеИВозвратМатериалов/Forms/СписокРемонтов/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Для Каждого Строка Из Параметры.МассивСтрок Цикл
		НС = Объект.Ремонты.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("es='La lista de reparaciones exigentes ""%1"" con característica ""%2""';ru='Список ремонтов, требующих ""%1"" с характеристикой ""%2""';en='List of repairs requiring ""%1"" with characteristic ""%2""'"),
			Параметры.Номенклатура,Параметры.Характеристика);
	Иначе
		ЭтаФорма.Заголовок = СтрШаблон(НСтр("es='La lista de reparaciones exigentes ""%1""';ru='Список ремонтов, требующих ""%1""';en='List of repairs requiring ""%1""'"),
			Параметры.Номенклатура);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРемонты

&НаКлиенте
Процедура РемонтыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
	ОткрытьДокументСПозиционированиемНаРемонте(ДанныеСтроки.ДокументОснование, ДанныеСтроки.ID_Ремонта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьДокументСПозиционированиемНаРемонте(Документ, ID)

	Если ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ПланГрафикРемонта") Тогда
		ОткрытьФорму("Документ.торо_ПланГрафикРемонта.ФормаОбъекта", Новый Структура("Ключ, ID", Документ, ID), ЭтаФорма);
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
		ОткрытьФорму("Документ.торо_ЗаявкаНаРемонт.ФормаОбъекта", Новый Структура("Ключ, ID", Документ, ID), ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
